Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg54/edc/ATSAMG54G19.PIC
      <edc:AdjustPoint edc:offset="0x34" edc:_addr="0x400E020C"/>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_SCFG0" edc:nzwidth="0x20" edc:access="-----------nnnnn--------nnnnnnnn" edc:impl="0x1F00FF" edc:_addr="0x400E0240">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="SLOT_CYCLE" edc:nzwidth="0x8" edc:desc="Maximum Number of Allowed Cycles for a Burst"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DEFMSTR_TYPE" edc:nzwidth="0x2" edc:desc="Default Master Type">
              <edc:SFRFieldSemantic edc:cname="NO_DEFAULT" edc:desc="At the end of current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in having a one cycle latency for the first access of a burst transfer or for a single access." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LAST" edc:desc="At the end of current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having the one cycle latency when the last master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FIXED" edc:desc="At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having the one cycle latency when the fixed master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIXED_DEFMSTR" edc:nzwidth="0x3" edc:desc="Fixed Default Master"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_SCFG1" edc:nzwidth="0x20" edc:access="-----------nnnnn--------nnnnnnnn" edc:impl="0x1F00FF" edc:_addr="0x400E0244">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="SLOT_CYCLE" edc:nzwidth="0x8" edc:desc="Maximum Number of Allowed Cycles for a Burst"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DEFMSTR_TYPE" edc:nzwidth="0x2" edc:desc="Default Master Type">
              <edc:SFRFieldSemantic edc:cname="NO_DEFAULT" edc:desc="At the end of current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in having a one cycle latency for the first access of a burst transfer or for a single access." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LAST" edc:desc="At the end of current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having the one cycle latency when the last master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FIXED" edc:desc="At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having the one cycle latency when the fixed master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIXED_DEFMSTR" edc:nzwidth="0x3" edc:desc="Fixed Default Master"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_SCFG2" edc:nzwidth="0x20" edc:access="-----------nnnnn--------nnnnnnnn" edc:impl="0x1F00FF" edc:_addr="0x400E0248">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="SLOT_CYCLE" edc:nzwidth="0x8" edc:desc="Maximum Number of Allowed Cycles for a Burst"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DEFMSTR_TYPE" edc:nzwidth="0x2" edc:desc="Default Master Type">
              <edc:SFRFieldSemantic edc:cname="NO_DEFAULT" edc:desc="At the end of current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in having a one cycle latency for the first access of a burst transfer or for a single access." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LAST" edc:desc="At the end of current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having the one cycle latency when the last master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FIXED" edc:desc="At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having the one cycle latency when the fixed master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIXED_DEFMSTR" edc:nzwidth="0x3" edc:desc="Fixed Default Master"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_SCFG3" edc:nzwidth="0x20" edc:access="-----------nnnnn--------nnnnnnnn" edc:impl="0x1F00FF" edc:_addr="0x400E024C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="SLOT_CYCLE" edc:nzwidth="0x8" edc:desc="Maximum Number of Allowed Cycles for a Burst"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DEFMSTR_TYPE" edc:nzwidth="0x2" edc:desc="Default Master Type">
              <edc:SFRFieldSemantic edc:cname="NO_DEFAULT" edc:desc="At the end of current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in having a one cycle latency for the first access of a burst transfer or for a single access." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LAST" edc:desc="At the end of current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having the one cycle latency when the last master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FIXED" edc:desc="At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having the one cycle latency when the fixed master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIXED_DEFMSTR" edc:nzwidth="0x3" edc:desc="Fixed Default Master"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x30" edc:_addr="0x400E0250"/>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_PRAS0" edc:nzwidth="0x20" edc:access="------------------nn--nn--nn--nn" edc:impl="0x3333" edc:_addr="0x400E0280">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x2" edc:desc="Master 0 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x2" edc:desc="Master 1 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x2" edc:desc="Master 2 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x2" edc:desc="Master 3 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x400E0284"/>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_PRAS1" edc:nzwidth="0x20" edc:access="------------------nn--nn--nn--nn" edc:impl="0x3333" edc:_addr="0x400E0288">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x2" edc:desc="Master 0 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x2" edc:desc="Master 1 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x2" edc:desc="Master 2 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x2" edc:desc="Master 3 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x400E028C"/>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_PRAS2" edc:nzwidth="0x20" edc:access="------------------nn--nn--nn--nn" edc:impl="0x3333" edc:_addr="0x400E0290">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x2" edc:desc="Master 0 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x2" edc:desc="Master 1 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x2" edc:desc="Master 2 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x2" edc:desc="Master 3 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x400E0294"/>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_PRAS3" edc:nzwidth="0x20" edc:access="------------------nn--nn--nn--nn" edc:impl="0x3333" edc:_addr="0x400E0298">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x2" edc:desc="Master 0 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x2" edc:desc="Master 1 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x2" edc:desc="Master 2 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x2" edc:desc="Master 3 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x78" edc:_addr="0x400E029C"/>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="CCFG_SYSIO" edc:nzwidth="0x20" edc:access="-------------------n----nnnn----" edc:impl="0x10F0" edc:_addr="0x400E0314">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SYSIO4" edc:nzwidth="0x1" edc:desc="PB4 or TDI Assignment"/>
            <edc:SFRFieldDef edc:cname="SYSIO5" edc:nzwidth="0x1" edc:desc="PB5 or TDO/TRACESWO Assignment"/>
            <edc:SFRFieldDef edc:cname="SYSIO6" edc:nzwidth="0x1" edc:desc="PB6 or TMS/SWDIO Assignment"/>
            <edc:SFRFieldDef edc:cname="SYSIO7" edc:nzwidth="0x1" edc:desc="PB7 or TCK/SWCLK Assignment"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SYSIO12" edc:nzwidth="0x1" edc:desc="PB12 or ERASE Assignment"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
