Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg54/edc/ATSAMG54G19.PIC
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_FOCR" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x400E0478">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="FOCLR" edc:nzwidth="0x1" edc:desc="Fault Output Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x68" edc:_addr="0x400E047C"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400E04E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x504D43"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x400E04E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x24" edc:_addr="0x400E04EC"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_OCR" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x400E0510">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CAL8" edc:nzwidth="0x7" edc:desc="RC Oscillator Calibration bits for 8 MHz"/>
            <edc:SFRFieldDef edc:cname="SEL8" edc:nzwidth="0x1" edc:desc="Selection of RC Oscillator Calibration bits for 8 MHz"/>
            <edc:SFRFieldDef edc:cname="CAL16" edc:nzwidth="0x7" edc:desc="RC Oscillator Calibration bits for 16 MHz"/>
            <edc:SFRFieldDef edc:cname="SEL16" edc:nzwidth="0x1" edc:desc="Selection of RC Oscillator Calibration bits for 16 MHz"/>
            <edc:SFRFieldDef edc:cname="CAL24" edc:nzwidth="0x7" edc:desc="RC Oscillator Calibration bits for 24 MHz"/>
            <edc:SFRFieldDef edc:cname="SEL24" edc:nzwidth="0x1" edc:desc="Selection of RC Oscillator Calibration bits for 24 MHz"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SLPWK_ER0" edc:nzwidth="0x20" edc:access="--wwwwwwwwwwwwwwwwwwwwww--------" edc:impl="0x3FFFFF00" edc:_addr="0x400E0514">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:nzwidth="0x1" edc:desc="Peripheral 8 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID9" edc:nzwidth="0x1" edc:desc="Peripheral 9 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:nzwidth="0x1" edc:desc="Peripheral 10 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:nzwidth="0x1" edc:desc="Peripheral 11 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID12" edc:nzwidth="0x1" edc:desc="Peripheral 12 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:nzwidth="0x1" edc:desc="Peripheral 13 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:nzwidth="0x1" edc:desc="Peripheral 14 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID15" edc:nzwidth="0x1" edc:desc="Peripheral 15 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:nzwidth="0x1" edc:desc="Peripheral 16 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID17" edc:nzwidth="0x1" edc:desc="Peripheral 17 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID18" edc:nzwidth="0x1" edc:desc="Peripheral 18 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:nzwidth="0x1" edc:desc="Peripheral 19 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:nzwidth="0x1" edc:desc="Peripheral 20 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID21" edc:nzwidth="0x1" edc:desc="Peripheral 21 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:nzwidth="0x1" edc:desc="Peripheral 22 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:nzwidth="0x1" edc:desc="Peripheral 23 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:nzwidth="0x1" edc:desc="Peripheral 24 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:nzwidth="0x1" edc:desc="Peripheral 25 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:nzwidth="0x1" edc:desc="Peripheral 26 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:nzwidth="0x1" edc:desc="Peripheral 27 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:nzwidth="0x1" edc:desc="Peripheral 28 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:nzwidth="0x1" edc:desc="Peripheral 29 SleepWalking Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SLPWK_DR0" edc:nzwidth="0x20" edc:access="--wwwwwwwwwwwwwwwwwwwwww--------" edc:impl="0x3FFFFF00" edc:_addr="0x400E0518">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:nzwidth="0x1" edc:desc="Peripheral 8 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID9" edc:nzwidth="0x1" edc:desc="Peripheral 9 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:nzwidth="0x1" edc:desc="Peripheral 10 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:nzwidth="0x1" edc:desc="Peripheral 11 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID12" edc:nzwidth="0x1" edc:desc="Peripheral 12 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:nzwidth="0x1" edc:desc="Peripheral 13 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:nzwidth="0x1" edc:desc="Peripheral 14 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID15" edc:nzwidth="0x1" edc:desc="Peripheral 15 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:nzwidth="0x1" edc:desc="Peripheral 16 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID17" edc:nzwidth="0x1" edc:desc="Peripheral 17 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID18" edc:nzwidth="0x1" edc:desc="Peripheral 18 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:nzwidth="0x1" edc:desc="Peripheral 19 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:nzwidth="0x1" edc:desc="Peripheral 20 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID21" edc:nzwidth="0x1" edc:desc="Peripheral 21 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:nzwidth="0x1" edc:desc="Peripheral 22 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:nzwidth="0x1" edc:desc="Peripheral 23 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:nzwidth="0x1" edc:desc="Peripheral 24 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:nzwidth="0x1" edc:desc="Peripheral 25 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:nzwidth="0x1" edc:desc="Peripheral 26 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:nzwidth="0x1" edc:desc="Peripheral 27 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:nzwidth="0x1" edc:desc="Peripheral 28 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:nzwidth="0x1" edc:desc="Peripheral 29 SleepWalking Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
