Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg54/edc/ATSAMG54G19.PIC
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_TPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E0908">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="TXPTR" edc:nzwidth="0x20" edc:desc="Transmit Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_TCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x400E090C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="TXCTR" edc:nzwidth="0x10" edc:desc="Transmit Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_RNPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E0910">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXNPTR" edc:nzwidth="0x20" edc:desc="Receive Next Pointer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_RNCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x400E0914">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXNCTR" edc:nzwidth="0x10" edc:desc="Receive Next Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_TNPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E0918">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="TXNPTR" edc:nzwidth="0x20" edc:desc="Transmit Next Pointer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_TNCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x400E091C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="TXNCTR" edc:nzwidth="0x10" edc:desc="Transmit Counter Next"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_PTCR" edc:nzwidth="0x20" edc:access="-------w----wwww------ww------ww" edc:impl="0x10F0303" edc:_addr="0x400E0920">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:nzwidth="0x1" edc:desc="Receiver Transfer Enable"/>
            <edc:SFRFieldDef edc:cname="RXTDIS" edc:nzwidth="0x1" edc:desc="Receiver Transfer Disable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:nzwidth="0x1" edc:desc="Transmitter Transfer Enable"/>
            <edc:SFRFieldDef edc:cname="TXTDIS" edc:nzwidth="0x1" edc:desc="Transmitter Transfer Disable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:nzwidth="0x1" edc:desc="Receiver Circular Buffer Enable"/>
            <edc:SFRFieldDef edc:cname="RXCBDIS" edc:nzwidth="0x1" edc:desc="Receiver Circular Buffer Disable"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:nzwidth="0x1" edc:desc="Transmitter Circular Buffer Enable"/>
            <edc:SFRFieldDef edc:cname="TXCBDIS" edc:nzwidth="0x1" edc:desc="Transmitter Circular Buffer Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ERRCLR" edc:nzwidth="0x1" edc:desc="Transfer Bus Error Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_PTSR" edc:nzwidth="0x20" edc:access="-------r-----r-r-------r-------r" edc:impl="0x1050101" edc:_addr="0x400E0924">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:nzwidth="0x1" edc:desc="Receiver Transfer Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:nzwidth="0x1" edc:desc="Transmitter Transfer Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:nzwidth="0x1" edc:desc="Receiver Circular Buffer Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:nzwidth="0x1" edc:desc="Transmitter Circular Buffer Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="Transfer Bus Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xD8" edc:_addr="0x400E0928"/>
      <edc:SFRDef ltx:memberofperipheral="EFC" edc:cname="EEFC_FMR" edc:nzwidth="0x20" edc:access="-----n-n-------n----nnnn-------n" edc:impl="0x5010F01" edc:_addr="0x400E0A00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EFC">
            <edc:SFRFieldDef edc:cname="FRDY" edc:nzwidth="0x1" edc:desc="Flash Ready Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="FWS" edc:nzwidth="0x4" edc:desc="Flash Wait State"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SCOD" edc:nzwidth="0x1" edc:desc="Sequential Code Optimization Disable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="FAM" edc:nzwidth="0x1" edc:desc="Flash Access Mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CLOE" edc:nzwidth="0x1" edc:desc="Code Loop Optimization Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
