Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg54/edc/ATSAMG54G19.PIC
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x400E1428"/>
      <edc:SFRDef ltx:memberofperipheral="RTT" edc:cname="RTT_MR" edc:nzwidth="0x20" edc:access="-------n---n-nnnnnnnnnnnnnnnnnnn" edc:impl="0x117FFFF" edc:_addr="0x400E1430">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="RTPRES" edc:nzwidth="0x10" edc:desc="Real-time Timer Prescaler Value"/>
            <edc:SFRFieldDef edc:cname="ALMIEN" edc:nzwidth="0x1" edc:desc="Alarm Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RTTINCIEN" edc:nzwidth="0x1" edc:desc="Real-time Timer Increment Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RTTRST" edc:nzwidth="0x1" edc:desc="Real-time Timer Restart"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTDIS" edc:nzwidth="0x1" edc:desc="Real-time Timer Disable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RTC1HZ" edc:nzwidth="0x1" edc:desc="Real-Time Clock 1Hz Clock Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTT" edc:cname="RTT_AR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E1434">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="ALMV" edc:nzwidth="0x20" edc:desc="Alarm Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTT" edc:cname="RTT_VR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x400E1438">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="CRTV" edc:nzwidth="0x20" edc:desc="Current Real-time Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTT" edc:cname="RTT_SR" edc:nzwidth="0x20" edc:access="------------------------------rr" edc:impl="0x3" edc:_addr="0x400E143C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="ALMS" edc:nzwidth="0x1" edc:desc="Real-time Alarm Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RTTINC" edc:nzwidth="0x1" edc:desc="Prescaler Roll-over Status (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x400E1440"/>
      <edc:SFRDef ltx:memberofperipheral="WDT" edc:cname="WDT_CR" edc:nzwidth="0x20" edc:access="wwwwwwww-----------------------w" edc:impl="0xFF000001" edc:_addr="0x400E1450">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="WDT">
            <edc:SFRFieldDef edc:cname="WDRSTT" edc:nzwidth="0x1" edc:desc="Watchdog Restart"/>
            <edc:AdjustPoint edc:offset="0x17"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Password.">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="WDT" edc:cname="WDT_MR" edc:nzwidth="0x20" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x3FFFFFFF" edc:_addr="0x400E1454">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="WDT">
            <edc:SFRFieldDef edc:cname="WDV" edc:nzwidth="0xC" edc:desc="Watchdog Counter Value"/>
            <edc:SFRFieldDef edc:cname="WDFIEN" edc:nzwidth="0x1" edc:desc="Watchdog Fault Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WDRSTEN" edc:nzwidth="0x1" edc:desc="Watchdog Reset Enable"/>
            <edc:SFRFieldDef edc:cname="WDRPROC" edc:nzwidth="0x1" edc:desc="Watchdog Reset Processor"/>
            <edc:SFRFieldDef edc:cname="WDDIS" edc:nzwidth="0x1" edc:desc="Watchdog Disable"/>
            <edc:SFRFieldDef edc:cname="WDD" edc:nzwidth="0xC" edc:desc="Watchdog Delta Value"/>
            <edc:SFRFieldDef edc:cname="WDDBGHLT" edc:nzwidth="0x1" edc:desc="Watchdog Debug Halt"/>
            <edc:SFRFieldDef edc:cname="WDIDLEHLT" edc:nzwidth="0x1" edc:desc="Watchdog Idle Halt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="WDT" edc:cname="WDT_SR" edc:nzwidth="0x20" edc:access="------------------------------rr" edc:impl="0x3" edc:_addr="0x400E1458">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="WDT">
            <edc:SFRFieldDef edc:cname="WDUNF" edc:nzwidth="0x1" edc:desc="Watchdog Underflow"/>
            <edc:SFRFieldDef edc:cname="WDERR" edc:nzwidth="0x1" edc:desc="Watchdog Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x400E145C"/>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_CR" edc:nzwidth="0x20" edc:access="--------------nn------nn------nn" edc:impl="0x30303" edc:_addr="0x400E1460">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="UPDTIM" edc:nzwidth="0x1" edc:desc="Update Request Time Register"/>
            <edc:SFRFieldDef edc:cname="UPDCAL" edc:nzwidth="0x1" edc:desc="Update Request Calendar Register"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TIMEVSEL" edc:nzwidth="0x2" edc:desc="Time Event Selection">
              <edc:SFRFieldSemantic edc:cname="MINUTE" edc:desc="Minute change" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HOUR" edc:desc="Hour change" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MIDNIGHT" edc:desc="Every day at midnight" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="NOON" edc:desc="Every day at noon" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="CALEVSEL" edc:nzwidth="0x2" edc:desc="Calendar Event Selection">
              <edc:SFRFieldSemantic edc:cname="WEEK" edc:desc="Week change (every Monday at time 00:00:00)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MONTH" edc:desc="Month change (every 01 of each month at time 00:00:00)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="YEAR" edc:desc="Year change (every January 1 at time 00:00:00)" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
