Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg54/edc/ATSAMG54G19.PIC
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="SHPR1" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0xE000ED18">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="PRI_4" edc:nzwidth="0x8" edc:desc="Priority of system handler 4, MemManage"/>
            <edc:SFRFieldDef edc:cname="PRI_5" edc:nzwidth="0x8" edc:desc="Priority of system handler 5, BusFault"/>
            <edc:SFRFieldDef edc:cname="PRI_6" edc:nzwidth="0x8" edc:desc="Priority of system handler 6, UsageFault"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="SHPR2" edc:nzwidth="0x20" edc:access="nnnnnnnn------------------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF000000" edc:_addr="0xE000ED1C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="PRI_11" edc:nzwidth="0x8" edc:desc="Priority of system handler 11, SVCall"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="SHPR3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn----------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF0000" edc:_addr="0xE000ED20">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="PRI_14" edc:nzwidth="0x8" edc:desc="Priority of system handler 14, PendSV"/>
            <edc:SFRFieldDef edc:cname="PRI_15" edc:nzwidth="0x8" edc:desc="Priority of system handler 15, SysTick exception"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="SHCSR" edc:nzwidth="0x20" edc:access="-------------nnnnnnnnn-nn---n-nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FD8B" edc:_addr="0xE000ED24">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="MEMFAULTACT" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="exception is not active" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="exception is active" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BUSFAULTACT" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="exception is not active" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="exception is active" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="USGFAULTACT" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="exception is not active" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="exception is active" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SVCALLACT" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="exception is not active" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="exception is active" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MONITORACT" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="exception is not active" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="exception is active" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDSVACT" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="exception is not active" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="exception is active" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SYSTICKACT" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="exception is not active" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="exception is active" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="USGFAULTPENDED" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="exception is not pending" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="exception is pending" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MEMFAULTPENDED" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="exception is not pending" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="exception is pending" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BUSFAULTPENDED" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="exception is not pending" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="exception is pending" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SVCALLPENDED" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="exception is not pending" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="exception is pending" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MEMFAULTENA" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="disable the exception" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="enable the exception" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BUSFAULTENA" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="disable the exception" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="enable the exception" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="USGFAULTENA" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="disable the exception" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="enable the exception" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="CFSR" edc:nzwidth="0x20" edc:access="------nn----nnnnn-nnnnnnn-nnn-nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x30FBFBB" edc:_addr="0xE000ED28">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="IACCVIOL" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no instruction access violation fault" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="the processor attempted an instruction fetch from a location that does not permit execution" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DACCVIOL" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no data access violation fault" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="the processor attempted a load or store at a location that does not permit the operation" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MUNSTKERR" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no unstacking fault" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="unstack for an exception return has caused one or more access violations" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MSTKERR" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no stacking fault" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="stacking for an exception entry has caused one or more access violations" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MLSPERR" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="No MemManage fault occurred during floating-point lazy state preservation" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="A MemManage fault occurred during floating-point lazy state preservation" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MMARVALID" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="value in MMAR is not a valid fault address" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="MMAR holds a valid fault address" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="IBUSERR" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no instruction bus error" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="instruction bus error" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PRECISERR" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no precise data bus error" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="a data bus error has occurred, and the PC value stacked for the exception return points to the instruction that caused the fault" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="IMPRECISERR" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no imprecise data bus error" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="a data bus error has occurred, but the return address in the stack frame is not related to the instruction that caused the error" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="UNSTKERR" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no unstacking fault" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="unstack for an exception return has caused one or more BusFaults" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STKERR" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no stacking fault" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="stacking for an exception entry has caused one or more BusFaults" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LSPERR" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="No bus fault occurred during floating-point lazy state preservation" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="A bus fault occurred during floating-point lazy state preservation" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BFARVALID" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="value in BFAR is not a valid fault address" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="BFAR holds a valid fault address" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="UNDEFINSTR" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no undefined instruction UsageFault" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="the processor has attempted to execute an undefined instruction" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INVSTATE" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no invalid state UsageFault" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="the processor has attempted to execute an instruction that makes illegal use of the EPSR" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INVPC" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no invalid PC load UsageFault" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="the processor has attempted an illegal load of EXC_RETURN to the PC" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NOCP" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no UsageFault caused by attempting to access a coprocessor" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="the processor has attempted to access a coprocessor" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="UNALIGNED" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no unaligned access fault, or unaligned access trapping not enabled" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="the processor has made an unaligned memory access" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIVBYZERO" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no divide by zero fault, or divide by zero trapping not enabled" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="the processor has executed an SDIV or UDIV instruction with a divisor of 0" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="HFSR" edc:nzwidth="0x20" edc:access="nn----------------------------n-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xC0000002" edc:_addr="0xE000ED2C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VECTTBL" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no BusFault on vector table read" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="BusFault on vector table read" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1C"/>
            <edc:SFRFieldDef edc:cname="FORCED" edc:nzwidth="0x1" edc:desc="no description available">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no forced HardFault" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="forced HardFault" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DEBUGEVT" edc:nzwidth="0x1" edc:desc="no description available"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
